emacs.org
#+TITLE: Emacs configuration file
#+AUTHOR: Stephen Fromm
#+OPTIONS: toc:4 h:3
#+PROPERTY: header-args:emacs-lisp :tangle "init.el" :results silent :exports code
#+MACRO: export-date (eval (format-time-string "%F %R %z" (current-time)))

Updated: *{{{export-date}}}*

* Overview

** Official links to this document

- Git repository ::  https://github.com/sfromm/emacs.d

** What is this?
The following document contains my configuration for [[https://www.gnu.org/software/emacs/][Emacs]].  This is based on
 the idea of [[http://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][literate programming]], where code and commentary are embedded in the
 same document.  The benefit of this approach is you get all the benefits of
 [[https://orgmode.org][Org-mode]] with [[https://orgmode.org/worg/org-contrib/babel/][Babel]] to lay out and document the code.

I try to use =setq= or =:custom= in =use-package= for much of my configuration.
For those that parts that need to remain private, I will use =customize= or pull
the configuration in via a separate lisp file.

This configuration used to be in straight lisp files, with various modules for
different sets of functionality.  And before that, it was an /Org/ file.  I came
back to laying this out with /Org/ because I ultimately think that there is more
benefit with to tangling from an /Org/ file because you have a lot more tools to
document and describe what the intent is and what some of the more important
pieces are.

This configuration is built to immediately tangle =early-init.el= and =init.el=
whenever I save the file.  For reference, it is possible parse the configuration
without tangling it with something like the following:

#+begin_src emacs-lisp :tangle no
(require 'org)
(org-babel-load-file
 (expand-file-name "emacs.org"
                   user-emacs-directory))
#+end_src

** COPYING

#+NAME: license
#+begin_src emacs-lisp :tangle no
;; Copyright (C) 2021 by Stephen Fromm

;; This program is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published by
;; the Free Software Foundation, either version 3 of the License, or
;; (at your option) any later version.

;; This program is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
;; GNU General Public License for more details.

;; You should have received a copy of the GNU General Public License
;; along with this program.  If not, see <http://www.gnu.org/licenses/>.
#+end_src

** Installation
First things first.  Clone the git repository:

#+begin_example
$ git clone https://github.com/sfromm/emacs.d ~/.emacs.d
#+end_example

If you do not already have Emacs installed, you can use the =make install=
target.  On MacOSX, this will use [[https://brew.sh/][Homebrew]] to install Emacs.

On the first time you run this configuration, it will go install several
packages.  This may take awhile, so please be patient.  You can also run the
target =make bootstrap= command to install the main packages needed.

** Configuration

There are a couple directories you use to store any personal or site-specific
configuration.  Everything in =forge-personal-dir= is ignored by /git/.

- =forge-site-dir= :: *~/.emacs.d/site-lisp*
- =forge-personal-dir= :: *~/.emacs.d/user*

** Updates
You can keep up to date by using the =make update= target.  This will do a few
things:

- Do a =git pull= to pull in the latest changes to /emacs-forge/.
- Run the function =forge/update-packages= to update the installed Emacs packages.

** Inspiration

There are many elements of this configuration that are drawn from other users'
configurations online.  Below is a list, in no particular order, of some of
those configurations that caught my eye.

- [[http://sachachua.com/blog/][Sacha Chua]]'s [[http://sachac.github.io/.emacs.d/Sacha.html][emacs configuration]]
- [[https://github.com/jwiegley/dot-emacs][John Wiegley]]
- [[https://protesilaos.com/][Protesilaos Stavrou]]: [[https://protesilaos.com/dotemacs/][dotemacs]]
- [[http://doc.norang.ca/org-mode.html][Bernt Hansen (norang.ca) Org Mode]] (Organize Your Life in Plain Text)
- [[http://eschulte.github.io/emacs24-starter-kit/][Emacs Starter Kit]]
- [[https://www.wisdomandwonder.com][Grant Rettke]]:  [[https://github.com/grettke/lolsmacs][lolsmacs]], and previously [[https://github.com/grettke/home/blob/master/ALEC.org][ALEC]]
- [[http://kitchingroup.cheme.cmu.edu/blog/][John Kitchin]]:  [[https://github.com/jkitchin/scimax][emacs configuration]]
- [[http://www.howardism.org][Howard Abrams]]:  [[https://github.com/howardabrams/dot-files][Emacs and dot files]]
- [[https://github.com/bzg/dotemacs/blob/master/emacs.el][Bastien Guerry]]
- [[https://github.com/larstvei/dot-emacs][Lars Tveito]]
- [[https://github.com/purcell/emacs.d][Steve Purcell]]
- [[http://zeekat.nl/articles/making-emacs-work-for-me.html][Making Emacs work for me]]
- [[https://github.com/jd/emacs.d][Julien Danmmjou]]
- [[https://github.com/joedicastro/dotfiles/tree/master/emacs][Joe Di Castro]]
- [[http://org.rix.si/][Ryan Rix]]:  [[http://doc.rix.si/cce/cce.html][Complete Computing Environment]] (formerly [[http://doc.rix.si/org/fsem.html][Hardcore Freestyle Emacs]] [[http://fort.kickass.systems:10082/cgit/personal/rrix/pub/fsem.git/tree/fsem.org][org source]])
- [[https://github.com/abelardojarab/emacs-config][Abelardo Jara-Berrocal]]
- [[https://writequit.org][Lee Hinman]]'s [[https://writequit.org/eos/eos.html][Emacs Operating System]] (see https://github.com/dakrone/eos)
- [[http://karl-voit.at/][Karl Voit]]'s [[https://github.com/novoid/dot-emacs][dot-emacs]]
- [[https://github.com/DamienCassou/emacs.d/blob/master/init.el][Damien Cassou]]
- [[https://github.com/hlissner][Henrik Lissner]] [[https://github.com/hlissner/doom-emacs][Doom Emacs]]
- [[https://gitlab.com/ambrevar/dotfiles][Ambrevar]]
- [[http://www.djcbsoftware.nl/dot-emacs.html][DJCB]]
- [[https://luca.cambiaghi.me/vanilla-emacs/readme.html][Luca Cambiaghi]]
* Early initialization
This uses =package-quickstart= to help with loading packages.  See [[https://git.savannah.gnu.org/cgit/emacs.git/commit/etc/NEWS?id=6dfdf0c9e8e4aca77b148db8d009c862389c64d3][the commit]]
for more information.  To go with this, it is important to precompute the
autoload file using =(package-quickstart-refresh)=.  The quickstart file is
relocated to /.emacs.d/var/.

#+begin_src emacs-lisp :tangle early-init.el :noweb yes
;;; early-init.el --- Early Init File -*- lexical-binding: t -*-
<<license>>

(setq package-enable-at-startup t)            ;; initialize now with package-quickstart
(setq package-quickstart-file (locate-user-emacs-file "var/package-quickstart.el"))
(setq package-quickstart t)
(setq gc-cons-threshold most-positive-fixnum) ;; Set garbage collection to highest threshold
(setq message-log-max 16384)                  ;; Turn up logging settings
#+end_src

=file-name-handler-alist= is consulted on every =require=, =load=, and so on.
Borrowing from [[https://github.com/hlissner/doom-emacs][doom-emacs]], I set this to =nil= temporarily during startup so as
to achieve a minor speed up.

#+begin_src emacs-lisp :tangle early-init.el
(unless (daemonp)
  (defvar init-file-name-handler-alist file-name-handler-alist)
  ;; Crank garbage collection to 11 for initialization.
  ;; Reset after init
  (setq file-name-handler-alist nil))

(defun init-reset-file-handler-alist ()
  "Reset `file-handler-alist' to initial value after startup."
  (setq file-name-handler-alist init-file-name-handler-alist))

(defun init-reset-garbage-collection ()
  "Reset garbage collection settings after startup."
  (setq gc-cons-threshold 16777216 ;; 16mb
        gc-cons-percentage 0.1
        message-log-max 1024))

(defun init-reset-startup-settings ()
  (init-reset-file-handler-alist)
  (init-reset-garbage-collection))

(add-hook 'emacs-startup-hook #'init-reset-startup-settings)
#+end_src

* Startup
Do some housekeeping to measure start up time.  See [[https://nullprogram.com/blog/2016/12/22/][this post]] on using /lexical binding/.

#+begin_src emacs-lisp :noweb yes
;;; init.el --- Init File -*- lexical-binding: t -*-

<<license>>

(message "Loading up Emacs...")
(defvar forge-core-start-time (current-time))

(defun forge/report-startup-time ()
  "Report startup time."
  (interactive)
  (message "Emacs is ready, finished loading after %.03fs."
           (float-time (time-subtract after-init-time before-init-time))))

(add-hook 'emacs-startup-hook #'forge/report-startup-time)
#+end_src

* Basics
** Variables for path information
The following is meant to help keep =~.emacs.d/= tidy.  The idea is not original
and basically comes from [[https://github.com/emacscollective/no-littering][no-littering]].  Perhaps in the future I will look to
pulling this package in.

#+begin_src emacs-lisp
(defvar forge-site-dir (expand-file-name "site-lisp/" user-emacs-directory)
  "Path to user's site configuration.")

(defvar forge-personal-dir (expand-file-name "user/" user-emacs-directory)
  "Path to user's personal configuration.")

(defvar forge-themes-dir (expand-file-name "themes/" user-emacs-directory)
  "Path to user themes.")

(defvar forge-state-dir (expand-file-name "var/" user-emacs-directory)
  "Path to Emacs' persistent data files.")

(defvar forge-backup-dir (expand-file-name "backup/" forge-state-dir)
  "Path to Emacs' backup and autosave files.")

(defvar forge-log-dir (expand-file-name "log/" forge-state-dir)
  "Path to Emacs packages' log files.")

(add-to-list 'load-path forge-site-dir)
(add-to-list 'custom-theme-load-path forge-themes-dir)

(defun forge/clean-user-emacs-directory ()
  "Set appropriate paths to keep `user-emacs-directory' clean."
  (interactive)
  (with-no-warnings
    (setq gamegrid-user-score-file-directory (expand-file-name "games" forge-state-dir)
          bookmark-default-file (expand-file-name "bookmarks" forge-state-dir)
          transient-history-file (expand-file-name "transient/history.el" forge-state-dir)
          transient-levels-file (expand-file-name "transient/levels.el" forge-personal-dir)
          transient-values-file (expand-file-name "transient/values.el" forge-personal-dir)
          message-auto-save-directory (expand-file-name "messages" forge-state-dir)
          tramp-auto-save-directory (expand-file-name "tramp/auto-save" forge-state-dir)
          tramp-persistency-file-name (expand-file-name "tramp/persistency.el" forge-state-dir)
          url-cache-directory (expand-file-name "url/cache/" forge-state-dir)
          url-configuration-directory (expand-file-name "url/configuration/" forge-state-dir))))

(defun forge/initialize ()
  "Initialize paths and session for this Emacs instance."
  (dolist (dir (list forge-site-dir forge-personal-dir forge-state-dir forge-backup-dir forge-log-dir))
    (unless (file-directory-p dir)
      (make-directory dir t)))
  (forge/clean-user-emacs-directory)
  (setq inhibit-splash-screen t
        ;; always load the newer version of a file
        load-prefer-newer t
        ;; warn when opening files bigger than 50MB
        large-file-warning-threshold 50000000))

(forge/initialize)
#+end_src

Create a customization group for variables specific to this configuration.

#+begin_src emacs-lisp
(defgroup forge nil
  "Forge custom settings."
  :group 'environment)
#+end_src
** Helper functions
The following are several helper functions that are used across the configuration.
*** Platform helpers
#+begin_src emacs-lisp
;;; Platform specific details.
(defun forge/system-type-darwin-p ()
  "Return non-nil if system is Darwin/MacOS."
  (string-equal system-type "darwin"))

(defun forge/system-type-windows-p ()
  "Return non-nil if system is Windows."
  (string-equal system-type "windows-nt"))

(defun forge/system-type-linux-p ()
  "Return non-nil if system is GNU/Linux."
  (string-equal system-type "gnu/linux"))
#+end_src
